Revit 2027 API
Connector.AssignedFlowDirection Property
The assigned flow direction of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlowDirectionType AssignedFlowDirection { get; }
Public ReadOnly Property AssignedFlowDirection As FlowDirectionType
	Get
public:
property FlowDirectionType AssignedFlowDirection {
	FlowDirectionType get ();
}
member AssignedFlowDirection : FlowDirectionType with get
Property Value
FlowDirectionType
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the connector is not in a family instance. Thrown when the connector's domain is not DomainHvac or DomainPiping.
InvalidOperationException |  Thrown on failure to get assigned flow direction.
Remarks
Flow direction may be assigned for connectors of some family instances.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace